import {T_Rocket} from "src/modules/types.ts";

export const SampleMocks:T_Rocket[] = [
    {
        id: 1,
        name: "Roubion",
        status: 1,
        image: "",
        description: "Тип грунта, вероятно, назван в честь одной из местностей на Земле или конкретно в контексте геологии Марса. Вопрос требует дальнейшего уточнения, так как такой термин может не быть общепринятым в литературе.",
        date_discovery: "13 октября 2023г"
    },
    {
        id: 2,
        name: "Montdenier",
        status: 1,
        image: "",
        description: "Как и в случае с Roubion, Montdenier может быть теоретически определён как тип грунта, но требуется больше контекста для точного понимания. Возможно, это название связано с определённым геологическим формированием или областью на Марсе.",
        date_discovery: "5 ноября 2022г"
    },
    {
        id: 3,
        name: "Montagnac",
        status: 1,
        image: "",
        description: "Скорее всего, данный термин также не является общепринятым в марсианской геологии. В геологии может использоваться для обозначения членств в определённых формациях.",
        date_discovery: "9 сентября 2023г"
    },
    {
        id: 4,
        name: "Salette",
        status: 1,
        image: "",
        description: "Salette может относиться к типу грунта или конкретному географическому объекту на Марсе. Однако, в доступной геологической литературе о Марсе информации об этом типе, как правило, нет",
        date_discovery: "5 декабря 2021г"
    }
]